
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыНакопления.РегистрНакопления1.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	
	Для Каждого Запись Из ТабличнаяЧасть1 Цикл
		
		Движение = Набор.Добавить();
		
		Движение.Период = ЭтотОбъект.Дата;
		Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Движение.Измерение1 = Запись.Реквизит1;
		Движение.Ресурс1    = Запись.Реквизит2;
		Движение.Реквизит1  = Запись.Реквизит3;
		
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры
