
#Область ПрограммныйИнтерфейс

Функция ФорматСообщенияПоУмолчанию() Экспорт
	
	ЭтотУзел = ПланыОбмена.МеханизмРепликации.ЭтотУзел();
	
	ФорматНеУказан = Перечисления.МеханизмРепликацииФорматСообщения.ПустаяСсылка();
	
	Если ЭтотУзел.ФорматСообщения = ФорматНеУказан Тогда
		
		Возврат Перечисления.МеханизмРепликацииФорматСообщения.JDTO;
		
	Иначе
		
		Возврат ЭтотУзел.ФорматСообщения;
		
	КонецЕсли;
	
КонецФункции

Функция ToJSON(СтруктураДанных) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ""));
	
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON();
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных, НастройкиСериализацииJSON);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ПолучитьМассивФорматов(СообщениеРепликации) Экспорт
	
	МассивФорматов = Новый Массив();
	
	ФорматНеУказан = Перечисления.МеханизмРепликацииФорматСообщения.ПустаяСсылка();
	ФорматПоУмолчанию = ФорматСообщенияПоУмолчанию();
	
	Для Каждого Получатель Из СообщениеРепликации.Получатели Цикл
		
		Если Получатель.Формат = ФорматНеУказан Тогда
			Получатель.Формат = ФорматПоУмолчанию;
		КонецЕсли;
		
		Если МассивФорматов.Найти(Получатель.Формат) = Неопределено Тогда
			МассивФорматов.Добавить(Получатель.Формат);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивФорматов.Количество() = 0 Тогда
		МассивФорматов.Добавить(ФорматПоУмолчанию);
	КонецЕсли;
	
	Возврат МассивФорматов;
	
КонецФункции

Функция ЗаписатьJDTO1C(Источник) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ""));
	
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Источник, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ЗаписатьXDTO1C(Источник) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Источник, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция ЗаписатьJDTO(Источник, ПараметрыРепликации) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ""));
	
	Если ПараметрыРепликации.ЭтоСсылочныйОбъект Тогда
		СериализоватьСсылочныйОбъект(Источник, ПараметрыРепликации, ЗаписьJSON);
	Иначе
		СериализоватьНаборЗаписейРегистра(Источник, ПараметрыРепликации, ЗаписьJSON);
	КонецЕсли;
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти

#Область Формат_JDTO_механизма_репликации

Функция ПолучитьИмяТипаЗначения(Значение)
	
	Если Значение = Неопределено Или Значение = NULL Тогда
		Возврат "undefined";
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Булево") Тогда
		
		Возврат "boolean";
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Возврат "number";
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Возврат "datetime";
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Возврат "string";
		
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		
		Возврат "uuid";
		
	ИначеЕсли ТипЗначения = Тип("ХранилищеЗначения") Тогда
		
		Возврат "binary";
		
	ИначеЕсли ТипЗначения = Тип("ВидДвиженияНакопления") Тогда
		
		Возврат "ВидДвиженияНакопления";
		
	Иначе // Ссылка
		
		Возврат Значение.Метаданные().ПолноеИмя();
	
	КонецЕсли;
	
КонецФункции

Процедура СериализоватьЗначениеСвойства(ИмяТипаЗначения, Значение, ЗаписьJSON)
	
	Если Значение = Неопределено Или Значение = NULL Тогда // undefined
		
		ЗаписьJSON.ЗаписатьЗначение(Неопределено);
		
	ИначеЕсли ИмяТипаЗначения = "datetime" Тогда
		
		ЗаписьJSON.ЗаписатьЗначение(Формат(Значение, "ДФ=гггг-ММ-ддTЧЧ:мм:сс"));
		
	ИначеЕсли ИмяТипаЗначения = "boolean" Или ИмяТипаЗначения = "number" Или ИмяТипаЗначения = "string" Тогда
		
		ЗаписьJSON.ЗаписатьЗначение(Значение);
		
	ИначеЕсли ИмяТипаЗначения = "uuid" Или ИмяТипаЗначения = "binary" Тогда
		
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Значение));
		
	ИначеЕсли ИмяТипаЗначения = "ВидДвиженияНакопления" Тогда
		
		ЗаписьJSON.ЗаписатьЗначение(?(Значение = ВидДвиженияНакопления.Приход, "Приход", "Расход"));
		
	Иначе // Ссылка, в том числе перечисление
		
		Если Лев(ИмяТипаЗначения, 12) = "Перечисление" Тогда
			ЗначениеСсылки = XMLСтрока(Значение);
		Иначе
			ЗначениеСсылки = XMLСтрока(Значение.УникальныйИдентификатор());
		КонецЕсли;
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("type");
		ЗаписьJSON.ЗаписатьЗначение(ИмяТипаЗначения);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("value");
		ЗаписьJSON.ЗаписатьЗначение(ЗначениеСсылки);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СериализоватьСвойствоОбъекта(ИмяСвойства, Значение, ЗаписьJSON)
	
	ЗаписьJSON.ЗаписатьИмяСвойства(ИмяСвойства);
	
	ИмяТипаЗначения = ПолучитьИмяТипаЗначения(Значение);
	
	СериализоватьЗначениеСвойства(ИмяТипаЗначения, Значение, ЗаписьJSON);
	
КонецПроцедуры

Процедура СериализоватьРеквизитыОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		
		Значение = Источник[Реквизит.Имя];
		
		СериализоватьСвойствоОбъекта(Реквизит.Имя, Значение, ЗаписьJSON);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СериализоватьИзмеренияОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
		
		Значение = Источник[Измерение.Имя];
		
		СериализоватьСвойствоОбъекта(Измерение.Имя, Значение, ЗаписьJSON);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СериализоватьРесурсыОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	Для Каждого Ресурс Из ОбъектМетаданных.Ресурсы Цикл
		
		Значение = Источник[Ресурс.Имя];
		
		СериализоватьСвойствоОбъекта(Ресурс.Имя, Значение, ЗаписьJSON);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СериализоватьРеквизитыАдресацииОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	Для Каждого РеквизитАдресации Из ОбъектМетаданных.РеквизитыАдресации Цикл
		
		Значение = Источник[РеквизитАдресации.Имя];
		
		СериализоватьСвойствоОбъекта(РеквизитАдресации.Имя, Значение, ЗаписьJSON);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СериализоватьТабличныеЧастиОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
		
		ЗаписьJSON.ЗаписатьИмяСвойства(ИмяТабличнойЧасти);
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		ДанныеТабличнойЧасти = Источник[ИмяТабличнойЧасти];
		
		Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			СериализоватьРеквизитыОбъекта(Запись, ТабличнаяЧасть, ЗаписьJSON);
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СериализоватьМассивРеквизитовОбъекта(Источник, МетаданныеРеквизитов, ЗаписьJSON)
	
	Для Каждого Реквизит Из МетаданныеРеквизитов Цикл
		
		Свойство = Реквизит.Имя;
		Значение = Источник[Свойство];
		
		СериализоватьСвойствоОбъекта(Свойство, Значение, ЗаписьJSON);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОбщиеРеквизитыОбъекта(ОбъектМетаданных)
	
	МассивОбщихРеквизитов = Новый Массив();
	
	ЭтоРазделитель = Метаданные.СвойстваОбъектов.РазделениеДанныхОбщегоРеквизита.Разделять;
	АвтоДляОбъекта =  Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто;
	ДаИспользовать = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
	НеИспользовать = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.НеИспользовать;
	ИспользоватьДляАвто = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать;
	
	Для Каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		
		Если ОбщийРеквизит.РазделениеДанных = ЭтоРазделитель Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаДляОбъекта = ОбщийРеквизит.Состав.Найти(ОбъектМетаданных);
		
		Если НастройкаДляОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаДляОбъекта.Использование = НеИспользовать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаДляОбъекта.Использование = ДаИспользовать Тогда
			
			МассивОбщихРеквизитов.Добавить(ОбщийРеквизит);
		
		ИначеЕсли НастройкаДляОбъекта.Использование = АвтоДляОбъекта
			И ОбщийРеквизит.АвтоИспользование = ИспользоватьДляАвто Тогда
			
			МассивОбщихРеквизитов.Добавить(ОбщийРеквизит);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОбщихРеквизитов;
	
КонецФункции

#Область Ссылочные_Объекты

Процедура СериализоватьСсылочныйОбъект(Источник, ПараметрыРепликации, ЗаписьJSON)
	
	Если ПараметрыРепликации.ЭтоУдаление Тогда
		СериализоватьУдалениеСсылочногоОбъекта(Источник, ПараметрыРепликации, ЗаписьJSON);
	Иначе
		СериализоватьИзменениеСсылочногоОбъекта(Источник, ПараметрыРепликации, ЗаписьJSON);
	КонецЕсли;
	
КонецПроцедуры

Процедура СериализоватьУдалениеСсылочногоОбъекта(Источник, ПараметрыРепликации, ЗаписьJSON)
	
	Значение = Источник.Ссылка;
	
	ИмяТипаЗначения = ПолучитьИмяТипаЗначения(Значение);
	
	СериализоватьЗначениеСвойства(ИмяТипаЗначения, Значение, ЗаписьJSON);
	
КонецПроцедуры

Процедура СериализоватьИзменениеСсылочногоОбъекта(Источник, ПараметрыРепликации, ЗаписьJSON)
	
	ОбъектМетаданных = Источник.Метаданные();
	МассивОбщихРеквизитов = ПолучитьОбщиеРеквизитыОбъекта(ОбъектМетаданных);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗначениеСсылки = Источник.Ссылка.УникальныйИдентификатор();
	
	СериализоватьСвойствоОбъекта("Ссылка", ЗначениеСсылки, ЗаписьJSON);
	
	// Сериализация специфичных реквизитов объектов
	
	Если ПараметрыРепликации.ТипОбъекта = "Документ" Тогда
		
		СериализоватьДокумент(Источник, ОбъектМетаданных, ЗаписьJSON);
	
	ИначеЕсли ПараметрыРепликации.ТипОбъекта = "Справочник" Тогда
		
		СериализоватьСправочник(Источник, ОбъектМетаданных, ЗаписьJSON);
		
	ИначеЕсли ПараметрыРепликации.ТипОбъекта = "Задача" Тогда
		
		СериализоватьЗадача(Источник, ОбъектМетаданных, ЗаписьJSON);
		
	ИначеЕсли ПараметрыРепликации.ТипОбъекта = "БизнесПроцесс" Тогда
		
		СериализоватьБизнесПроцесс(Источник, ОбъектМетаданных, ЗаписьJSON);
		
	ИначеЕсли ПараметрыРепликации.ТипОбъекта = "ПланВидовХарактеристик" Тогда
		
		СериализоватьПланВидовХарактеристик(Источник, ОбъектМетаданных, ЗаписьJSON);
		
	КонецЕсли;
	
	// Сериализация общих для всех реквизитов объектов
	
	СериализоватьРеквизитыОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON);
	
	СериализоватьМассивРеквизитовОбъекта(Источник, МассивОбщихРеквизитов, ЗаписьJSON);
	
	СериализоватьТабличныеЧастиОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Процедура СериализоватьДокумент(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	СериализоватьСвойствоОбъекта("ПометкаУдаления", Источник.ПометкаУдаления, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("Дата", Источник.Дата, ЗаписьJSON);
	
	Если ОбъектМетаданных.ДлинаНомера > 0 Тогда
		СериализоватьСвойствоОбъекта("Номер", Источник.Номер, ЗаписьJSON);
	КонецЕсли;
	
	СериализоватьСвойствоОбъекта("Проведён", Источник.Проведен, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("ВерсияДанных", Источник.ВерсияДанных, ЗаписьJSON);
	
КонецПроцедуры

Процедура СериализоватьСправочник(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	ИерархияГрупп = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
	
	Если ОбъектМетаданных.Иерархический И ОбъектМетаданных.ВидИерархии = ИерархияГрупп Тогда
		СериализоватьСвойствоОбъекта("ЭтоГруппа", Источник.ЭтоГруппа, ЗаписьJSON);
	КонецЕсли;
	
	СериализоватьСвойствоОбъекта("ПометкаУдаления", Источник.ПометкаУдаления, ЗаписьJSON);
	
	Если ОбъектМетаданных.Владельцы.Количество() > 0 Тогда
		СериализоватьСвойствоОбъекта("Владелец", Источник.Владелец, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.Иерархический Тогда
		СериализоватьСвойствоОбъекта("Родитель", Источник.Родитель, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.ДлинаКода > 0 Тогда
		СериализоватьСвойствоОбъекта("Код", Источник.Код, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.ДлинаНаименования > 0 Тогда
		СериализоватьСвойствоОбъекта("Наименование", Источник.Наименование, ЗаписьJSON);
	КонецЕсли;
	
	СериализоватьСвойствоОбъекта("ВерсияДанных", Источник.ВерсияДанных, ЗаписьJSON);
	
КонецПроцедуры

Процедура СериализоватьЗадача(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	СериализоватьСвойствоОбъекта("ПометкаУдаления", Источник.ПометкаУдаления, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("БизнесПроцесс", Источник.БизнесПроцесс, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("Дата", Источник.Дата, ЗаписьJSON);
	
	Если ОбъектМетаданных.ДлинаНомера > 0 Тогда
		СериализоватьСвойствоОбъекта("Номер", Источник.Номер, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.ДлинаНаименования > 0 Тогда
		СериализоватьСвойствоОбъекта("Наименование", Источник.Наименование, ЗаписьJSON);
	КонецЕсли;
	
	СериализоватьСвойствоОбъекта("Выполнена", Источник.Выполнена, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("ВерсияДанных", Источник.ВерсияДанных, ЗаписьJSON);
	
	СериализоватьРеквизитыАдресацииОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON);
	
КонецПроцедуры

Процедура СериализоватьБизнесПроцесс(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	СериализоватьСвойствоОбъекта("ПометкаУдаления", Источник.ПометкаУдаления, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("Дата", Источник.Дата, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("Завершён", Источник.Выполнена, ЗаписьJSON);
	
	Если ОбъектМетаданных.ДлинаНомера > 0 Тогда
		СериализоватьСвойствоОбъекта("Номер", Источник.Номер, ЗаписьJSON);
	КонецЕсли;
	
	СериализоватьСвойствоОбъекта("ВедущаяЗадача", Источник.ВедущаяЗадача, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("Стартован", Источник.Стартован, ЗаписьJSON);
	
	СериализоватьСвойствоОбъекта("ВерсияДанных", Источник.ВерсияДанных, ЗаписьJSON);
	
	СериализоватьРеквизитыАдресацииОбъекта(Источник, ОбъектМетаданных, ЗаписьJSON);
	
КонецПроцедуры

Процедура СериализоватьПланВидовХарактеристик(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	ИерархияГрупп = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
	
	Если ОбъектМетаданных.Иерархический И ОбъектМетаданных.ВидИерархии = ИерархияГрупп Тогда
		СериализоватьСвойствоОбъекта("ЭтоГруппа", Источник.ЭтоГруппа, ЗаписьJSON);
	КонецЕсли;
	
	СериализоватьСвойствоОбъекта("ПометкаУдаления", Источник.ПометкаУдаления, ЗаписьJSON);
	
	Если ОбъектМетаданных.Иерархический Тогда
		СериализоватьСвойствоОбъекта("Родитель", Источник.Родитель, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.ДлинаКода > 0 Тогда
		СериализоватьСвойствоОбъекта("Код", Источник.Код, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.ДлинаНаименования > 0 Тогда
		СериализоватьСвойствоОбъекта("Наименование", Источник.Наименование, ЗаписьJSON);
	КонецЕсли;
	
	//СериализоватьСвойствоОбъекта("ТипЗначения", Источник.ТипЗначения, ЗаписьJSON); // ОписаниеТипов
	
	СериализоватьСвойствоОбъекта("ВерсияДанных", Источник.ВерсияДанных, ЗаписьJSON);
	
КонецПроцедуры

#КонецОбласти

#Область Наборы_Записей_Регистров

Процедура СериализоватьНаборЗаписейРегистра(Источник, ПараметрыРепликации, ЗаписьJSON)
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	Если ПараметрыРепликации.РежимЗамещения <> Ложь Тогда // Не Добавление
		// Свойство "delete"
		СериализоватьОтборНабораЗаписейРегистра(Источник, ПараметрыРепликации, ЗаписьJSON);
	КонецЕсли;
	
	Если Источник.Количество() > 0 Тогда
		// Свойство "insert"
		СериализоватьЗаписиНабораЗаписейРегистра(Источник, ПараметрыРепликации, ЗаписьJSON);
	КонецЕсли;
	
	ЗаписьJSON.ЗаписатьКонецОбъекта()
	
КонецПроцедуры

Процедура СериализоватьОтборНабораЗаписейРегистра(Источник, ПараметрыРепликации, ЗаписьJSON)
	
	ЗаписьJSON.ЗаписатьИмяСвойства("delete");
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		
		Если ЭлементОтбора.Использование = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяСвойства = ЭлементОтбора.Имя;
		Значение = ЭлементОтбора.Значение;
		
		СериализоватьСвойствоОбъекта(ИмяСвойства, Значение, ЗаписьJSON);
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Процедура СериализоватьЗаписиНабораЗаписейРегистра(Источник, ПараметрыРепликации, ЗаписьJSON)
	
	ОбъектМетаданных = Источник.Метаданные();
	МассивОбщихРеквизитов = ПолучитьОбщиеРеквизитыОбъекта(ОбъектМетаданных);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("insert");
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Запись Из Источник Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		// Сериализация специфичных реквизитов объектов
		
		Если ПараметрыРепликации.ТипОбъекта = "РегистрСведений" Тогда
			
			СериализоватьРегистрСведений(Запись, ОбъектМетаданных, ЗаписьJSON);
			
		ИначеЕсли ПараметрыРепликации.ТипОбъекта = "РегистрНакопления" Тогда
			
			СериализоватьРегистрНакопления(Запись, ОбъектМетаданных, ЗаписьJSON);
			
		КонецЕсли;
		
		// Сериализация общих для всех реквизитов объектов
		
		СериализоватьИзмеренияОбъекта(Запись, ОбъектМетаданных, ЗаписьJSON);
		
		СериализоватьРесурсыОбъекта(Запись, ОбъектМетаданных, ЗаписьJSON);
		
		СериализоватьРеквизитыОбъекта(Запись, ОбъектМетаданных, ЗаписьJSON);
		
		СериализоватьМассивРеквизитовОбъекта(Запись, МассивОбщихРеквизитов, ЗаписьJSON);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
КонецПроцедуры

Процедура СериализоватьРегистрСведений(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	ПодчинениеРегистратору = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору;
	НепериодическийРегистр = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
	
	Если ОбъектМетаданных.ПериодичностьРегистраСведений <> НепериодическийРегистр Тогда
		СериализоватьСвойствоОбъекта("Период", Источник.Период, ЗаписьJSON);
	КонецЕсли;
	
	Если ОбъектМетаданных.РежимЗаписи = ПодчинениеРегистратору Тогда
		СериализоватьСвойствоОбъекта("Активность", Источник.Активность, ЗаписьJSON);
		СериализоватьСвойствоОбъекта("Регистратор", Источник.Регистратор, ЗаписьJSON);
		СериализоватьСвойствоОбъекта("НомерСтроки", Источник.НомерСтроки, ЗаписьJSON);
	КонецЕсли;
	
КонецПроцедуры

Процедура СериализоватьРегистрНакопления(Источник, ОбъектМетаданных, ЗаписьJSON)
	
	РегистрОстатков = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;
	
	СериализоватьСвойствоОбъекта("Период", Источник.Период, ЗаписьJSON);
	СериализоватьСвойствоОбъекта("Активность", Источник.Активность, ЗаписьJSON);
	СериализоватьСвойствоОбъекта("Регистратор", Источник.Регистратор, ЗаписьJSON);
	СериализоватьСвойствоОбъекта("НомерСтроки", Источник.НомерСтроки, ЗаписьJSON);
	
	Если ОбъектМетаданных.ВидРегистра = РегистрОстатков Тогда
		СериализоватьСвойствоОбъекта("ВидДвижения", Источник.ВидДвижения, ЗаписьJSON);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
