
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
&НаСервереБезКонтекста
Процедура Команда1НаСервере()
	
	Набор = РегистрыСведений.РегистрСведений1.СоздатьНаборЗаписей();
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать(Ложь);
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьВходящиеСообщения(Команда)
	ОбработатьВходящиеСообщенияНаСервере();
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ОбработатьВходящиеСообщенияНаСервере()
	МеханизмРепликацииИмпорт.ОбработатьВходящиеСообщения();
КонецПроцедуры